In [4]:
#Step 1
# Crwate Dataferame
import pandas as pd

In [8]:
d1=pd.DataFrame()
d1

Empty DataFrame
Columns: []
Index: []

In [12]:
type(d1)

pandas.core.frame.DataFrame

**Step 2** 

**Provide Data**

In [18]:
names=['a','b','c','d']
pd.DataFrame(names)

   0
0  a
1  b
2  c
3  d

In [20]:
names=['a','b','c','d']
age=[10,20,30,40]
pd.DataFrame(zip(names,age))

   0   1
0  a  10
1  b  20
2  c  30
3  d  40

In [24]:
names=['a','b','c','d']
age=[10,20,30,40]

data=(zip(names,age))
pd.DataFrame(data)

   0   1
0  a  10
1  b  20
2  c  30
3  d  40

In [26]:
names=['a','b','c','d']
age=[10,20,30,40]
city=['aa','bb','cc','dd']

data=(zip(names,age,city))
pd.DataFrame(data)

   0   1   2
0  a  10  aa
1  b  20  bb
2  c  30  cc
3  d  40  dd

**Step 3**

  **Provide Name to Column**

In [39]:
names=['a','b','c','d']
pd.DataFrame(names, columns=['Name'])

  Name
0    a
1    b
2    c
3    d

In [59]:
names=['a','b','c','d']
age=[10,20,30,40]
city=['aa','bb','cc','dd']

data=(zip(names,age,city))

      
pd.DataFrame(data, columns = ['Name','Age','City'])

  Name  Age City
0    a   10   aa
1    b   20   bb
2    c   30   cc
3    d   40   dd

In [53]:
names=['a','b','c','d']
age=[10,20,30,40]
city=['aa','bb','cc','dd']

data=(zip(names,age,city))

cols=['Name','Age','City']
pd.DataFrame(data, columns=cols)

  Name  Age City
0    a   10   aa
1    b   20   bb
2    c   30   cc
3    d   40   dd

In [3]:
import pandas as pd
names=['a','b','c','d']
age=[10,20,30,40]
city=['aa','bb','cc','dd']

pd.DataFrame(zip(names,age,city), columns=['Name','Age','City'])

  Name  Age City
0    a   10   aa
1    b   20   bb
2    c   30   cc
3    d   40   dd

** STep 4**

  **Providing Index**

In [8]:
names=['a','b','c','d']
age=[10,20,30,40]
city=['aa','bb','cc','dd']

data=(zip(names,age,city))

ix=['A', 'B', 'C', 'D']
cols=['Name','Age','City']

pd.DataFrame(data, columns=cols, index=ix)

  Name  Age City
A    a   10   aa
B    b   20   bb
C    c   30   cc
D    d   40   dd

In [12]:
names=['a','b','c','d']
age=[10,20,30,40]
ix=['aa','bb','cc','dd']

data=(zip(names,age))


cols=['Name','Age']

pd.DataFrame(data, columns=cols, index=ix)

   Name  Age
aa    a   10
bb    b   20
cc    c   30
dd    d   40